Revit 2027 API
BaseExportOptions.SetExportFontTable Method
 Sets font table to option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetExportFontTable(
	ExportFontTable fontTable
)
Public Sub SetExportFontTable (
	fontTable As ExportFontTable
)
public:
void SetExportFontTable(
	ExportFontTable^ fontTable
)
member SetExportFontTable :
        fontTable : ExportFontTable -> unit
Parameters
fontTable ExportFontTable
 The font table to be set.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BaseExportOptions Class
Autodesk.Revit.DB Namespace